day1/load_testing/logs/sync_sleep_0/passenger/siege_test_case_01.log
** SIEGE 4.1.7
** Preparing 30 concurrent users for battle.
The server is now under siege...
Lifting the server siege...
Transactions:		    70691    hits
Availability:		      100.00 %
Elapsed time:		       10.88 secs
Data transferred:	        3.37 MB
Response time:		        4.59 ms
Transaction rate:	     6497.33 trans/sec
Throughput:		        0.31 MB/sec
Concurrency:		       29.83
Successful transactions:    70691
Failed transactions:	        0
Longest transaction:	      130.00 ms
Shortest transaction:	        0.00 ms
 
0.00 secs:      50 bytes ==> GET  /sync_sleep/0
** SIEGE 4.1.7
** Preparing 40 concurrent users for battle.
The server is now under siege...
Lifting the server siege...
Transactions:		    74170    hits
Availability:		      100.00 %
Elapsed time:		       10.97 secs
Data transferred:	        3.54 MB
Response time:		        5.89 ms
Transaction rate:	     6761.17 trans/sec
Throughput:		        0.32 MB/sec
Concurrency:		       39.82
Successful transactions:    74170
Failed transactions:	        0
Longest transaction:	       90.00 ms
Shortest transaction:	        0.00 ms
 
1.1 200     0.00 secs:      50 bytes ==> GET  /sync_sleep/0
** SIEGE 4.1.7
** Preparing 50 concurrent users for battle.
The server is now under siege...
Lifting the server siege...
Transactions:		    71826    hits
Availability:		      100.00 %
Elapsed time:		       10.96 secs
Data transferred:	        3.42 MB
Response time:		        7.60 ms
Transaction rate:	     6553.47 trans/sec
Throughput:		        0.31 MB/sec
Concurrency:		       49.83
Successful transactions:    71826
Failed transactions:	        0
Longest transaction:	      100.00 ms
Shortest transaction:	        0.00 ms
 
ync_sleep/0